Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotDuplicateDesignOption Property
 Can't duplicate Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDuplicateDesignOption { get; }
Public Shared ReadOnly Property CannotDuplicateDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDuplicateDesignOption {
	FailureDefinitionId^ get ();
}
static member CannotDuplicateDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace